#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-stable/runs/run-AZkzucm2w1Syt3Kh

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_iam_user.packer: Refreshing state... [id=packer_stable]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.stable]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_stable]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_stable]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_stable]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_stable]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_stable]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_stable]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=internal_composer_syslog]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_stable]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_stable]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_stable]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_stable-20201204205417226300000005]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_stable-20201204205416966800000003]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_stable]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_stable-20201204205417254900000007]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_stable-20201204205416722700000002]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_stable-20201204205416687100000001]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-02523067c19e4d4ba]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-07a88a5868e40dd45]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-01cc703cab3a56c8f]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_stable]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_stable]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_stable]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_stable-20201204205417404800000008]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_stable-20201204205417237900000006]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_stable-20201204205417038600000004]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_stable]
aws_security_group.allow_egress: Refreshing state... [id=sg-097647189d3a6a245]
aws_security_group.allow_cockpit: Refreshing state... [id=sg-0e7a2b04fcc973c30]
aws_security_group.allow_icmp: Refreshing state... [id=sg-039dcb219d6199dbc]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_stable-2020120420541781800000000a]
aws_security_group.allow_ssh: Refreshing state... [id=sg-001c4a1bed68a6dc3]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0c62841533b873016]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_stable-20201204205417690700000009]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_stable-2020120420541783040000000b]
aws_launch_template.worker_x86: Refreshing state... [id=lt-0a7a7a9041e00925a]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-0789bee2463abeaba]
aws_network_interface.composer_internal: Refreshing state... [id=eni-0df7102235a986cee]
aws_instance.composer_internal: Refreshing state... [id=i-00c1e53d6434eb6f4]
aws_spot_fleet_request.imagebuilder_worker_x86: Refreshing state... [id=sfr-ded6537c-2fb6-4629-8c05-df496e4e55ef]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-2461795825]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-061d8f6c131a56963]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-3adeebe7-e5a0-4779-839e-5deabcc10a71]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.worker_internal_user_data will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "worker_internal_user_data"  {
      ~ id       = "1e1e9683af273a78ef188b243ece1e7a72e4c7157c57081b4648169d9cd959e1" -> (known after apply)
      ~ rendered = <<-EOT
            #!/bin/bash
            set -euxo pipefail
            
            # Variables from Terraform go here.
            OSBUILD_COMMIT=83caf800e52524b414f7f5bf5ae0d3c912c89192
            COMPOSER_COMMIT=2dff7d05298349ef59adf94a4de7a3dd289c06d3
            COMPOESR_HOST=aws.composer.osbuild.org
            COMPOSER_ADDRESS=10.30.18.10
            OSBUILD_CA_CERT=LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUREVENDQWZXZ0F3SUJBZ0lVUDNQM2YzNVBGUk51b2Z0emM5TDk2RGhUb2RBd0RRWUpLb1pJaHZjTkFRRUwKQlFBd0ZqRVVNQklHQTFVRUF3d0xiM05pZFdsc1pDNXZjbWN3SGhjTk1qQXdPVEV6TVRZeU1EVTNXaGNOTXpBdwpPVEV4TVRZeU1EVTNXakFXTVJRd0VnWURWUVFEREF0dmMySjFhV3hrTG05eVp6Q0NBU0l3RFFZSktvWklodmNOCkFRRUJCUUFEZ2dFUEFEQ0NBUW9DZ2dFQkFNQnBrWVFYSVNMYzhLWWpNUVlnenBROUNBM1JLMmdIRDBxYXFzdjgKYVJjVkM2NlM5ZkhxRUUxaUxVWE83MDJRejVza2poM3pxTHlHUjh3UlYvL2NJMWIxcjBVeVpTY0xaM1c3VVpyQwo0NDRmY3ozTXl4bFN6V1VZU1BnQklLaGdBOHFtclpSMW9mYWRyeHVSTCtzbkZESWt4M3crYzFKZVVuMmNsMFdpClV0WDJHR1ZDRldNT2FvZkRrWFVDRnVLSHdKUWdGTHRzSENaWWNmdldWSFpaNk44d0dwMlFaWTI5Yzh1bXBqMVAKUEZsWEM4ZGFaTE1hWFliRTBNSXRWMENISnB3R0lwYnlubVlUbCtzRnV2bDRvVG1yeHoveXh6cER2Vk1PckFJbQp4b2s3clVtVHVkRGVFU1JCT2dBMUt1YU1SVHVhSXBRbzJkb3ZxKzAxRmYzQU4yVUNBd0VBQWFOVE1GRXdIUVlEClZSME9CQllFRko3ZTZYM3kwZG9scS9KYlZpYklpd2RuU1ArNk1COEdBMVVkSXdRWU1CYUFGSjdlNlgzeTBkb2wKcS9KYlZpYklpd2RuU1ArNk1BOEdBMVVkRXdFQi93UUZNQU1CQWY4d0RRWUpLb1pJaHZjTkFRRUxCUUFEZ2dFQgpBRnp2N2llS0c5bFpLckIyTW1aaEFxSElMeWxhT3lWcTc3RzlCTVJURnNwWnU0MHI3R1R3Y0Rodmg1RUNvSFFiCmxrdTBYNU9YZ0R2WHNCcG9GSHJ2MEtPSWxTN1VKMXYwNGsvSllnWHcrbGpUVHMvOXpwbjhSVmxtcHUvR01PTTUKUWJHUCtOajVaczVmR0ZXaE43TTI1UWtVODJKbHhlSkFsUXhIQ2xDUGV4UkNNYTF5NXA3VG5nODBLSld0eVBQOQp0U2dNQnA3NVVSZW80NUU4UEpySnAzaHlvNFJ4OVJRR2tyeWNSSXdmQkh2a3hNSmZuc2M3WS92NWl1RjhteE16CjN0Yko5K0p5RUF1SHoxYkd1cUNYK3FKUVRUdC9RbzYydkdXYUk5U1ZLYlM4YVhMQzJONnFjaWJxcjU4ZjRESkQKSnNsTS83cHN5cjFvNXR0YkJuNlk1QXM9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K
            WORKER_SSL_KEYS_ARN=arn:aws:secretsmanager:us-east-1:933752197999:secret:brew_keys-7FUeel
            
            # Forward systemd journal to the console for easier viewing.
            # This is done at the beginning of this script so we log all errors.
            mkdir -p /etc/systemd/journald.conf.d/
            tee /etc/systemd/journald.conf.d/forward-to-console.conf > /dev/null << EOF
            [Journal]
            ForwardToConsole=yes
            MaxLevelConsole=6
            EOF
            
            # Ensure the SELinux contexts are correct.
            restorecon -Rv /etc/systemd
            
            # Restart journald to pick up the console log change.
            systemctl restart systemd-journald
            
            # Basic function to retry a command up to 5 times.
            function retry {
                local count=0
                local retries=5
                until "$@"; do
                    exit=$?
                    count=$((count + 1))
                    if [[ $count -lt $retries ]]; then
                        echo "Retrying command..."
                        sleep 1
                    else
                        echo "Command failed after ${retries} retries. Giving up."
                        return $exit
                    fi
                done
                return 0
            }
            
            # Variables for the script.
            COMPOSER_DIR=/etc/osbuild-composer
            
            # Deploy the dnf repository file for osbuild-composer.
            tee /etc/yum.repos.d/composer.repo > /dev/null << EOF
            [composer]
            name = osbuild-composer commit ${COMPOSER_COMMIT}
            baseurl = http://osbuild-composer-repos.s3-website.us-east-2.amazonaws.com/osbuild-composer/rhel-8.3/x86_64/${COMPOSER_COMMIT}
            enabled = 1
            gpgcheck = 0
            priority = 5
            EOF
            
            # Deploy the dnf repository file for osbuild.
            tee /etc/yum.repos.d/osbuild.repo > /dev/null << EOF
            [osbuild]
            name = osbuild commit ${OSBUILD_COMMIT}
            baseurl = http://osbuild-composer-repos.s3-website.us-east-2.amazonaws.com/osbuild/rhel-8.3/x86_64/${OSBUILD_COMMIT}
            enabled = 1
            gpgcheck = 0
            priority = 5
            EOF
            
            # Ensure we have an updated dnf cache.
            retry dnf makecache
            
            # Update all existing packages to their latest version.
            retry dnf -y upgrade
            
            # Install required packages.
            retry dnf -y install jq osbuild-composer-worker python3 unzip
            
            # Set up the AWS CLI.
            pushd /tmp
              curl --retry 5 -Ls -o awscli.zip https://awscli.amazonaws.com/awscli-exe-linux-x86_64.zip
              unzip awscli.zip
              aws/install
            popd
            
            # Set up /etc/hosts
            # TODO(mhayden): We need to convert this to DNS later when we launch.
            cat <<< "${COMPOSER_ADDRESS} ${COMPOESR_HOST}" >> /etc/hosts
            
            # Deploy the composer CA certificate.
            mkdir ${COMPOSER_DIR}
            base64 -d - <<< ${OSBUILD_CA_CERT} > ${COMPOSER_DIR}/ca-crt.pem
            
            # Deploy the composer key and certificate.
            /usr/local/bin/aws secretsmanager get-secret-value \
              --secret-id ${WORKER_SSL_KEYS_ARN} | jq -r ".SecretString" > /tmp/worker_keys.json
            jq -r ".worker_key" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-key.pem
            jq -r ".worker_crt" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-crt.pem
            rm -f /tmp/worker_keys.json
            
            # Prepare osbuild-composer's remote worker services and sockets.
            systemctl enable --now osbuild-remote-worker@${COMPOESR_HOST}:8700
            
        EOT -> (known after apply)
      ~ vars     = {
          ~ "composer_address"    = "10.30.18.10" -> (known after apply)
          ~ "setup_script"        = <<-EOT
                # Forward systemd journal to the console for easier viewing.
                # This is done at the beginning of this script so we log all errors.
                mkdir -p /etc/systemd/journald.conf.d/
                tee /etc/systemd/journald.conf.d/forward-to-console.conf > /dev/null << EOF
                [Journal]
                ForwardToConsole=yes
                MaxLevelConsole=6
                EOF
                
                # Ensure the SELinux contexts are correct.
                restorecon -Rv /etc/systemd
                
                # Restart journald to pick up the console log change.
                systemctl restart systemd-journald
                
                # Basic function to retry a command up to 5 times.
                function retry {
                    local count=0
                    local retries=5
                    until "$@"; do
                        exit=$?
                        count=$((count + 1))
                        if [[ $count -lt $retries ]]; then
                            echo "Retrying command..."
                            sleep 1
                        else
                            echo "Command failed after ${retries} retries. Giving up."
                            return $exit
                        fi
                    done
                    return 0
                }
                
                # Variables for the script.
                COMPOSER_DIR=/etc/osbuild-composer
                
              - # Deploy the dnf repository file for osbuild-composer.
              - tee /etc/yum.repos.d/composer.repo > /dev/null << EOF
              - [composer]
              - name = osbuild-composer commit ${COMPOSER_COMMIT}
              - baseurl = http://osbuild-composer-repos.s3-website.us-east-2.amazonaws.com/osbuild-composer/rhel-8.3/x86_64/${COMPOSER_COMMIT}
              - enabled = 1
              - gpgcheck = 0
              - priority = 5
              - EOF
              - 
              - # Deploy the dnf repository file for osbuild.
              - tee /etc/yum.repos.d/osbuild.repo > /dev/null << EOF
              - [osbuild]
              - name = osbuild commit ${OSBUILD_COMMIT}
              - baseurl = http://osbuild-composer-repos.s3-website.us-east-2.amazonaws.com/osbuild/rhel-8.3/x86_64/${OSBUILD_COMMIT}
              - enabled = 1
              - gpgcheck = 0
              - priority = 5
              - EOF
              - 
              - # Ensure we have an updated dnf cache.
              - retry dnf makecache
              - 
              - # Update all existing packages to their latest version.
              - retry dnf -y upgrade
              - 
              - # Install required packages.
              - retry dnf -y install jq osbuild-composer-worker python3 unzip
              - 
              - # Set up the AWS CLI.
              - pushd /tmp
              -   curl --retry 5 -Ls -o awscli.zip https://awscli.amazonaws.com/awscli-exe-linux-x86_64.zip
              -   unzip awscli.zip
              -   aws/install
              - popd
              - 
                # Set up /etc/hosts
                # TODO(mhayden): We need to convert this to DNS later when we launch.
                cat <<< "${COMPOSER_ADDRESS} ${COMPOESR_HOST}" >> /etc/hosts
                
                # Deploy the composer CA certificate.
                mkdir ${COMPOSER_DIR}
                base64 -d - <<< ${OSBUILD_CA_CERT} > ${COMPOSER_DIR}/ca-crt.pem
                
                # Deploy the composer key and certificate.
                /usr/local/bin/aws secretsmanager get-secret-value \
                  --secret-id ${WORKER_SSL_KEYS_ARN} | jq -r ".SecretString" > /tmp/worker_keys.json
                jq -r ".worker_key" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-key.pem
                jq -r ".worker_crt" /tmp/worker_keys.json | base64 -d - > ${COMPOSER_DIR}/worker-crt.pem
                rm -f /tmp/worker_keys.json
                
                # Prepare osbuild-composer's remote worker services and sockets.
                systemctl enable --now osbuild-remote-worker@${COMPOESR_HOST}:8700
            EOT
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # aws_instance.composer_internal must be replaced
-/+ resource "aws_instance" "composer_internal" {
      ~ ami                          = "ami-0c82f7789103a1e20" -> "ami-06ba06f30c04628ce" # forces replacement
      ~ arn                          = "arn:aws:ec2:us-east-1:933752197999:instance/i-00c1e53d6434eb6f4" -> (known after apply)
      ~ associate_public_ip_address  = false -> (known after apply)
      ~ availability_zone            = "us-east-1a" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 2 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-00c1e53d6434eb6f4" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      ~ key_name                     = "tgunders" -> "mhayden" # forces replacement
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-0df7102235a986cee" -> (known after apply)
      ~ private_dns                  = "ip-10-30-18-10.ec2.internal" -> (known after apply)
      ~ private_ip                   = "10.30.18.10" -> (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [] -> (known after apply)
      - source_dest_check            = true -> null
      ~ subnet_id                    = "subnet-04a176042c3118735" -> (known after apply)
        tags                         = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🏗 Internal Composer (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "7aa34ead1b1bb619d7769f0db2a00da9c8e35384" -> "28be6deabb2257f1423698856d2c4f9a0add62ab" # forces replacement
      ~ volume_tags                  = {
          - "AppCode"      = "IMGB-001"
          - "Name"         = "🏗 Internal Composer (stable)"
          - "ServiceOwner" = "Image Builder"
        } -> (known after apply)
      ~ vpc_security_group_ids       = [
          - "sg-02523067c19e4d4ba",
          - "sg-07a88a5868e40dd45",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdb" -> null
          - encrypted             = true -> null
          - iops                  = 150 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:933752197999:key/9630f91f-f3c0-42eb-b65d-3defffc79926" -> null
          - volume_id             = "vol-0789bee2463abeaba" -> null
          - volume_size           = 50 -> null
          - volume_type           = "gp2" -> null
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
        }


      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key_id            = (known after apply)
          ~ volume_id             = "vol-0a5e15a07b6393439" -> (known after apply)
          ~ volume_size           = 10 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # aws_launch_template.worker_internal_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_internal_x86" {
      ~ default_version         = 1 -> (known after apply)
        id                      = "lt-061d8f6c131a56963"
      ~ image_id                = "ami-0c82f7789103a1e20" -> "ami-06ba06f30c04628ce"
      ~ key_name                = "tgunders" -> "mhayden"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "imagebuilder_worker_internal_x86_stable"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 Internal Composer Worker (stable)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "IyEvYmluL2Jhc2gKc2V0IC1ldXhvIHBpcGVmYWlsCgojIFZhcmlhYmxlcyBmcm9tIFRlcnJhZm9ybSBnbyBoZXJlLgpPU0JVSUxEX0NPTU1JVD04M2NhZjgwMGU1MjUyNGI0MTRmN2Y1YmY1YWUwZDNjOTEyYzg5MTkyCkNPTVBPU0VSX0NPTU1JVD0yZGZmN2QwNTI5ODM0OWVmNTlhZGY5NGE0ZGU3YTNkZDI4OWMwNmQzCkNPTVBPRVNSX0hPU1Q9YXdzLmNvbXBvc2VyLm9zYnVpbGQub3JnCkNPTVBPU0VSX0FERFJFU1M9MTAuMzAuMTguMTAKT1NCVUlMRF9DQV9DRVJUPUxTMHRMUzFDUlVkSlRpQkRSVkpVU1VaSlEwRlVSUzB0TFMwdENrMUpTVVJFVkVORFFXWlhaMEYzU1VKQlowbFZVRE5RTTJZek5WQkdVazUxYjJaMGVtTTVURGsyUkdoVWIyUkJkMFJSV1VwTGIxcEphSFpqVGtGUlJVd0tRbEZCZDBacVJWVk5Ra2xIUVRGVlJVRjNkMHhpTTA1cFpGZHNjMXBETlhaamJXTjNTR2hqVGsxcVFYZFBWRVY2VFZSWmVVMUVWVE5YYUdOT1RYcEJkd3BQVkVWNFRWUlplVTFFVlROWGFrRlhUVkpSZDBWbldVUldVVkZFUkVGMGRtTXlTakZoVjNoclRHMDVlVnA2UTBOQlUwbDNSRkZaU2t0dldrbG9kbU5PQ2tGUlJVSkNVVUZFWjJkRlVFRkVRME5CVVc5RFoyZEZRa0ZOUW5CcldWRllTVk5NWXpoTFdXcE5VVmxuZW5CUk9VTkJNMUpMTW1kSVJEQnhZWEZ6ZGpnS1lWSmpWa00yTmxNNVpraHhSVVV4YVV4VldFODNNREpSZWpWemEycG9NM3B4VEhsSFVqaDNVbFl2TDJOSk1XSXhjakJWZVZwVFkweGFNMWMzVlZweVF3bzBORFJtWTNvelRYbDRiRk42VjFWWlUxQm5Ra2xMYUdkQk9IRnRjbHBTTVc5bVlXUnllSFZTVEN0emJrWkVTV3Q0TTNjcll6RktaVlZ1TW1Oc01GZHBDbFYwV0RKSFIxWkRSbGROVDJGdlprUnJXRlZEUm5WTFNIZEtVV2RHVEhSelNFTmFXV05tZGxkV1NGcGFOazQ0ZDBkd01sRmFXVEk1WXpoMWJYQnFNVkFLVUVac1dFTTRaR0ZhVEUxaFdGbGlSVEJOU1hSV01FTklTbkIzUjBsd1lubHViVmxVYkN0elJuVjJiRFJ2VkcxeWVIb3ZlWGg2Y0VSMlZrMVBja0ZKYlFwNGIyczNjbFZ0VkhWa1JHVkZVMUpDVDJkQk1VdDFZVTFTVkhWaFNYQlJiekprYjNaeEt6QXhSbVl6UVU0eVZVTkJkMFZCUVdGT1ZFMUdSWGRJVVZsRUNsWlNNRTlDUWxsRlJrbzNaVFpZTTNrd1pHOXNjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUNPRWRCTVZWa1NYZFJXVTFDWVVGR1NqZGxObGd6ZVRCa2Iyd0tjUzlLWWxacFlrbHBkMlJ1VTFBck5rMUJPRWRCTVZWa1JYZEZRaTkzVVVaTlFVMUNRV1k0ZDBSUldVcExiMXBKYUhaalRrRlJSVXhDVVVGRVoyZEZRZ3BCUm5wMk4ybGxTMGM1YkZwTGNrSXlUVzFhYUVGeFNFbE1lV3hoVDNsV2NUYzNSemxDVFZKVVJuTndXblUwTUhJM1IxUjNZMFJvZG1nMVJVTnZTRkZpQ214cmRUQllOVTlZWjBSMldITkNjRzlHU0hKMk1FdFBTV3hUTjFWS01YWXdOR3N2U2xsbldIY3JiR3BVVkhNdk9YcHdiamhTVm14dGNIVXZSMDFQVFRVS1VXSkhVQ3RPYWpWYWN6Vm1SMFpYYUU0M1RUSTFVV3RWT0RKS2JIaGxTa0ZzVVhoSVEyeERVR1Y0VWtOTllURjVOWEEzVkc1bk9EQkxTbGQwZVZCUU9RcDBVMmROUW5BM05WVlNaVzgwTlVVNFVFcHlTbkF6YUhsdk5GSjRPVkpSUjJ0eWVXTlNTWGRtUWtoMmEzaE5TbVp1YzJNM1dTOTJOV2wxUmpodGVFMTZDak4wWWtvNUswcDVSVUYxU0hveFlrZDFjVU5ZSzNGS1VWUlVkQzlSYnpZeWRrZFhZVWs1VTFaTFlsTTRZVmhNUXpKT05uRmphV0p4Y2pVNFpqUkVTa1FLU25Oc1RTODNjSE41Y2pGdk5YUjBZa0p1TmxrMVFYTTlDaTB0TFMwdFJVNUVJRU5GVWxSSlJrbERRVlJGTFMwdExTMEsKV09SS0VSX1NTTF9LRVlTX0FSTj1hcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLWVhc3QtMTo5MzM3NTIxOTc5OTk6c2VjcmV0OmJyZXdfa2V5cy03RlVlZWwKCiMgRm9yd2FyZCBzeXN0ZW1kIGpvdXJuYWwgdG8gdGhlIGNvbnNvbGUgZm9yIGVhc2llciB2aWV3aW5nLgojIFRoaXMgaXMgZG9uZSBhdCB0aGUgYmVnaW5uaW5nIG9mIHRoaXMgc2NyaXB0IHNvIHdlIGxvZyBhbGwgZXJyb3JzLgpta2RpciAtcCAvZXRjL3N5c3RlbWQvam91cm5hbGQuY29uZi5kLwp0ZWUgL2V0Yy9zeXN0ZW1kL2pvdXJuYWxkLmNvbmYuZC9mb3J3YXJkLXRvLWNvbnNvbGUuY29uZiA+IC9kZXYvbnVsbCA8PCBFT0YKW0pvdXJuYWxdCkZvcndhcmRUb0NvbnNvbGU9eWVzCk1heExldmVsQ29uc29sZT02CkVPRgoKIyBFbnN1cmUgdGhlIFNFTGludXggY29udGV4dHMgYXJlIGNvcnJlY3QuCnJlc3RvcmVjb24gLVJ2IC9ldGMvc3lzdGVtZAoKIyBSZXN0YXJ0IGpvdXJuYWxkIHRvIHBpY2sgdXAgdGhlIGNvbnNvbGUgbG9nIGNoYW5nZS4Kc3lzdGVtY3RsIHJlc3RhcnQgc3lzdGVtZC1qb3VybmFsZAoKIyBCYXNpYyBmdW5jdGlvbiB0byByZXRyeSBhIGNvbW1hbmQgdXAgdG8gNSB0aW1lcy4KZnVuY3Rpb24gcmV0cnkgewogICAgbG9jYWwgY291bnQ9MAogICAgbG9jYWwgcmV0cmllcz01CiAgICB1bnRpbCAiJEAiOyBkbwogICAgICAgIGV4aXQ9JD8KICAgICAgICBjb3VudD0kKChjb3VudCArIDEpKQogICAgICAgIGlmIFtbICRjb3VudCAtbHQgJHJldHJpZXMgXV07IHRoZW4KICAgICAgICAgICAgZWNobyAiUmV0cnlpbmcgY29tbWFuZC4uLiIKICAgICAgICAgICAgc2xlZXAgMQogICAgICAgIGVsc2UKICAgICAgICAgICAgZWNobyAiQ29tbWFuZCBmYWlsZWQgYWZ0ZXIgJHtyZXRyaWVzfSByZXRyaWVzLiBHaXZpbmcgdXAuIgogICAgICAgICAgICByZXR1cm4gJGV4aXQKICAgICAgICBmaQogICAgZG9uZQogICAgcmV0dXJuIDAKfQoKIyBWYXJpYWJsZXMgZm9yIHRoZSBzY3JpcHQuCkNPTVBPU0VSX0RJUj0vZXRjL29zYnVpbGQtY29tcG9zZXIKCiMgRGVwbG95IHRoZSBkbmYgcmVwb3NpdG9yeSBmaWxlIGZvciBvc2J1aWxkLWNvbXBvc2VyLgp0ZWUgL2V0Yy95dW0ucmVwb3MuZC9jb21wb3Nlci5yZXBvID4gL2Rldi9udWxsIDw8IEVPRgpbY29tcG9zZXJdCm5hbWUgPSBvc2J1aWxkLWNvbXBvc2VyIGNvbW1pdCAke0NPTVBPU0VSX0NPTU1JVH0KYmFzZXVybCA9IGh0dHA6Ly9vc2J1aWxkLWNvbXBvc2VyLXJlcG9zLnMzLXdlYnNpdGUudXMtZWFzdC0yLmFtYXpvbmF3cy5jb20vb3NidWlsZC1jb21wb3Nlci9yaGVsLTguMy94ODZfNjQvJHtDT01QT1NFUl9DT01NSVR9CmVuYWJsZWQgPSAxCmdwZ2NoZWNrID0gMApwcmlvcml0eSA9IDUKRU9GCgojIERlcGxveSB0aGUgZG5mIHJlcG9zaXRvcnkgZmlsZSBmb3Igb3NidWlsZC4KdGVlIC9ldGMveXVtLnJlcG9zLmQvb3NidWlsZC5yZXBvID4gL2Rldi9udWxsIDw8IEVPRgpbb3NidWlsZF0KbmFtZSA9IG9zYnVpbGQgY29tbWl0ICR7T1NCVUlMRF9DT01NSVR9CmJhc2V1cmwgPSBodHRwOi8vb3NidWlsZC1jb21wb3Nlci1yZXBvcy5zMy13ZWJzaXRlLnVzLWVhc3QtMi5hbWF6b25hd3MuY29tL29zYnVpbGQvcmhlbC04LjMveDg2XzY0LyR7T1NCVUlMRF9DT01NSVR9CmVuYWJsZWQgPSAxCmdwZ2NoZWNrID0gMApwcmlvcml0eSA9IDUKRU9GCgojIEVuc3VyZSB3ZSBoYXZlIGFuIHVwZGF0ZWQgZG5mIGNhY2hlLgpyZXRyeSBkbmYgbWFrZWNhY2hlCgojIFVwZGF0ZSBhbGwgZXhpc3RpbmcgcGFja2FnZXMgdG8gdGhlaXIgbGF0ZXN0IHZlcnNpb24uCnJldHJ5IGRuZiAteSB1cGdyYWRlCgojIEluc3RhbGwgcmVxdWlyZWQgcGFja2FnZXMuCnJldHJ5IGRuZiAteSBpbnN0YWxsIGpxIG9zYnVpbGQtY29tcG9zZXItd29ya2VyIHB5dGhvbjMgdW56aXAKCiMgU2V0IHVwIHRoZSBBV1MgQ0xJLgpwdXNoZCAvdG1wCiAgY3VybCAtLXJldHJ5IDUgLUxzIC1vIGF3c2NsaS56aXAgaHR0cHM6Ly9hd3NjbGkuYW1hem9uYXdzLmNvbS9hd3NjbGktZXhlLWxpbnV4LXg4Nl82NC56aXAKICB1bnppcCBhd3NjbGkuemlwCiAgYXdzL2luc3RhbGwKcG9wZAoKIyBTZXQgdXAgL2V0Yy9ob3N0cwojIFRPRE8obWhheWRlbik6IFdlIG5lZWQgdG8gY29udmVydCB0aGlzIHRvIEROUyBsYXRlciB3aGVuIHdlIGxhdW5jaC4KY2F0IDw8PCAiJHtDT01QT1NFUl9BRERSRVNTfSAke0NPTVBPRVNSX0hPU1R9IiA+PiAvZXRjL2hvc3RzCgojIERlcGxveSB0aGUgY29tcG9zZXIgQ0EgY2VydGlmaWNhdGUuCm1rZGlyICR7Q09NUE9TRVJfRElSfQpiYXNlNjQgLWQgLSA8PDwgJHtPU0JVSUxEX0NBX0NFUlR9ID4gJHtDT01QT1NFUl9ESVJ9L2NhLWNydC5wZW0KCiMgRGVwbG95IHRoZSBjb21wb3NlciBrZXkgYW5kIGNlcnRpZmljYXRlLgovdXNyL2xvY2FsL2Jpbi9hd3Mgc2VjcmV0c21hbmFnZXIgZ2V0LXNlY3JldC12YWx1ZSBcCiAgLS1zZWNyZXQtaWQgJHtXT1JLRVJfU1NMX0tFWVNfQVJOfSB8IGpxIC1yICIuU2VjcmV0U3RyaW5nIiA+IC90bXAvd29ya2VyX2tleXMuanNvbgpqcSAtciAiLndvcmtlcl9rZXkiIC90bXAvd29ya2VyX2tleXMuanNvbiB8IGJhc2U2NCAtZCAtID4gJHtDT01QT1NFUl9ESVJ9L3dvcmtlci1rZXkucGVtCmpxIC1yICIud29ya2VyX2NydCIgL3RtcC93b3JrZXJfa2V5cy5qc29uIHwgYmFzZTY0IC1kIC0gPiAke0NPTVBPU0VSX0RJUn0vd29ya2VyLWNydC5wZW0Kcm0gLWYgL3RtcC93b3JrZXJfa2V5cy5qc29uCgojIFByZXBhcmUgb3NidWlsZC1jb21wb3NlcidzIHJlbW90ZSB3b3JrZXIgc2VydmljZXMgYW5kIHNvY2tldHMuCnN5c3RlbWN0bCBlbmFibGUgLS1ub3cgb3NidWlsZC1yZW1vdGUtd29ya2VyQCR7Q09NUE9FU1JfSE9TVH06ODcwMAoK" -> (known after apply)
        # (6 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_internal_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_internal_x86" {
      ~ client_token                        = "terraform-2020120420550209480000000f" -> (known after apply)
      ~ id                                  = "sfr-3adeebe7-e5a0-4779-839e-5deabcc10a71" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "Image Builder internal worker fleet - stable"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-061d8f6c131a56963" -> null
              - version = "1" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-04a176042c3118735" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-061d8f6c131a56963"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-04a176042c3118735"
              + weighted_capacity = (known after apply)
            }
        }
    }

  # aws_volume_attachment.composer_internal must be replaced
-/+ resource "aws_volume_attachment" "composer_internal" {
      ~ id          = "vai-2461795825" -> (known after apply)
      ~ instance_id = "i-00c1e53d6434eb6f4" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ rhel8_x86          = "RHEL-8.3.0_HVM-20201031-x86_64-0-Access2-GP2 (ami-0c82f7789103a1e20)" -> "RHEL 8 cloud access: RHEL-8.3.0_HVM-20201031-x86_64-0-Access2-GP2 (ami-0c82f7789103a1e20)"
  + rhel8_x86_prebuilt = "RHEL 8 pre-built: imagebuilder-service-image-20201203155459 (ami-06ba06f30c04628ce)"

Warning: Value for undeclared variable

The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


Warning: Value for undeclared variable

The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY" but
a value was found in file "/terraform/terraform.tfvars". To use this value,
add a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Pusher: @major, Action: `pull_request`*